app/Livewire/EventList.php

    public function render()
    {
        $query = Event::whereHas('status', function ($q) {
            $q->where('status', 'approved');
        })->latest();

        if ($this->limit) {
            $events = $query->take($this->limit)->get();
---
select * from `events` where exists (select * from `event_statuses` where `events`.`id` = `event_statuses`.`event_id` and `status` = 'approved') order by `created_at` desc limit 4