app/Livewire/EventDetails.php

select * from `events` where `events`.`id` = '1' limit 1
---
    public function mount($id)
    {
        $this->event = Event::with(['categories', 'customCategories'])->findOrFail($id);