app/Livewire/EventPage.php

select * from `events` order by `created_at` desc limit 4
---
    public function render()
    {
        $banners = Event::latest()->take(4)->get();