app/Livewire/HistoryPage.php

select `events`.`id` as `event_id`, `events`.`title`, `penyertaan`.`pendaftar_id`, COUNT(pesertas.id) as total, SUM(CASE WHEN penyertaan.status_bayaran = "pending" THEN 1 ELSE 0 END) as pending_count, CASE WHEN SUM(CASE WHEN penyertaan.status_bayaran = 'pending' THEN 1 ELSE 0 END) > 0
THEN 'Pending'
ELSE 'Complete'
END as payment_status from `penyertaan` inner join `events` on `penyertaan`.`event_id` = `events`.`id` inner join `pesertas` on `penyertaan`.`peserta_id` = `pesertas`.`id` where `penyertaan`.`pendaftar_id` = 2 group by `events`.`id`, `events`.`title`, `penyertaan`.`pendaftar_id`
---
    public function show(){
        $userId = auth()->id();

        $this->historyEvent = DB::table('penyertaan')
        ->join('events', 'penyertaan.event_id', '=', 'events.id')
        ->join('pesertas', 'penyertaan.peserta_id', '=', 'pesertas.id')
        ->select('events.id as event_id', 'events.title','penyertaan.pendaftar_id')
        ->selectRaw('COUNT(pesertas.id) as total')
        ->selectRaw('SUM(CASE WHEN penyertaan.status_bayaran = "pending" THEN 1 ELSE 0 END) as pending_count')
        ->selectRaw("CASE WHEN SUM(CASE WHEN penyertaan.status_bayaran = 'pending' THEN 1 ELSE 0 END) > 0
                    THEN 'Pending'
                    ELSE 'Complete'
                    END as payment_status")
        ->where('penyertaan.pendaftar_id', $userId)
        ->groupBy('events.id', 'events.title','penyertaan.pendaftar_id')
        ->get();