app/Livewire/PaymentForm.php

select * from `events` where `events`.`id` in (1)
select * from `penyertaan` where `pendaftar_id` = 2 and `status_bayaran` = 'pending' and `event_id` = '1'
select * from `pesertas` where `pesertas`.`id` in (7, 8)
---
    public function loadRegistrations()
    {
        $pendaftarId = auth()->check() ? auth()->id() : session('guest_id');

        $this->registrations = Penyertaan::with('peserta', 'event')
            ->where('pendaftar_id', $pendaftarId)
            ->where('status_bayaran', 'pending')
            ->when($this->eventId, fn($q) => $q->where('event_id', $this->eventId))
            ->get();