app/Livewire/PesertaForm.php

select * from `events` where `events`.`id` = '1' limit 1
---
    public function mount($id)
    {
        $this->idIklan = $id;
        $this->event = \App\Models\Event::find($id);

select * from `pesertas` where `nama_penuh` like '%aira %' and `user_agent` = 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36 Edg/142.0.0.0'
---
    public function updatedPesertas($value, $key)
    {
        // $key contoh: "0.nama_penuh"
        [$index, $field] = explode('.', $key);

        if ($field === 'nama_penuh' && strlen($value) >= 2) {
            $this->suggestions[$index] = Peserta::where('nama_penuh', 'like', "%{$value}%")
                ->where('user_agent', request()->userAgent())
                ->get()
                ->map(function($item) {
                    return [
                        'id' => $item->id,
                        'nama_penuh' => $item->nama_penuh,
                        'kelas' => $item->kelas,
                    ];
                })
                ->toArray();

select * from `penyertaan` where `pendaftar_id` = 2 and `status_bayaran` = 'pending' limit 1
---
    public function save()
    {
        $savedIds = [];

        $groupToken = $this->groupToken ?? \Str::uuid()->toString();

        if (auth()->check()) {
            $pendaftarId = auth()->id();
        } else {
            // Kalau tak login → wajib isi maklumat pendaftar
            if (empty($this->pendaftar_nama) || empty($this->pendaftar_email)) {
                session()->flash('error', 'Sila isi nama dan email pendaftar.');
                return;
            }

            // Cipta atau ambil guest user
            $guest = User::firstOrCreate(
                ['email' => $this->pendaftar_email],
                [
                    'name' => $this->pendaftar_nama,
                    'password' => Hash::make(Str::random(8)),
                    'role' => 'guest',
                ]
            );

            $pendaftarId = $guest->id;
            session(['guest_id' => $pendaftarId]);
        }

        $pending = Penyertaan::where('pendaftar_id', $pendaftarId)
            ->where('status_bayaran', 'pending')
            ->first();

select * from `pesertas` where `ic` = '770607110436' limit 1
---
            if (!empty($p['gambar']) && is_object($p['gambar'])) {
                $validated['gambar'] = $p['gambar']->store('peserta', 'public');
            } else {
                $existingPeserta = Peserta::where('ic', $p['ic'])->first();

insert into `pesertas` (`ic`, `nama_penuh`, `nama_panggilan`, `kelas`, `email`, `jantina`, `tarikh_lahir`, `gambar`, `category`, `ip_address`, `user_agent`, `updated_at`, `created_at`) values ('770607110436', 'aira maisarah', 'aira', 'pssgjm', 'aira@test.com', 'Perempuan', '1977-06-07', null, 'Individu', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/142.0.0.0 Safari/537.36 Edg/142.0.0.0', '2025-11-27 03:41:36', '2025-11-27 03:41:36')
select * from `pesertas` where (`ic` = '770607110436') limit 1
---
                }
            }

            $peserta = Peserta::updateOrCreate(['ic' => $p['ic']], $validated);

select * from `penyertaan` where `event_id` = '1' and `peserta_id` = 9 limit 1
---
            $categoryType = $p['category'] === 'Individu' ? 'I' : 'G';
            $gabung = $categoryType . $kategoriUmur; // Contoh: IAM / GAF

            $existing = Penyertaan::where('event_id', $this->idIklan)
                ->where('peserta_id', $peserta->id)
                ->first();

select * from `penyertaan` where `event_id` = '1' and `kategori` = 'IAF' order by `id` desc limit 1
---

                } else {
                    // Cipta penyertaan baru
                    $lastEntry = Penyertaan::where('event_id', $this->idIklan)
                        ->where('kategori', $gabung)
                        ->orderByDesc('id')
                        ->first();

insert into `penyertaan` (`event_id`, `peserta_id`, `kategori`, `unique_id`, `group_token`, `status_bayaran`, `pendaftar_id`, `updated_at`, `created_at`) values ('1', 9, 'IAF', 'IAF-0003', '6364324e-5dbb-469e-876c-aaa7ce03c607', 'pending', 2, '2025-11-27 03:41:36', '2025-11-27 03:41:36')
---
                    $number = $lastEntry ? intval(substr($lastEntry->unique_id, -4)) + 1 : 1;
                    $uniqueId = $gabung . '-' . str_pad($number, 4, '0', STR_PAD_LEFT);

                    $penyertaan = Penyertaan::create([
                        'event_id' => $this->idIklan,
                        'peserta_id' => $peserta->id,
                        'kategori' => $gabung,
                        'unique_id' => $uniqueId,
                        'group_token' => $groupToken,
                        'status_bayaran' => 'pending',
                        'pendaftar_id' => $pendaftarId,
                    ]);