app/Livewire/SenaraiPeserta.php

    public function mount($eventId)
    {
        $this->eventId = $eventId;
        $userId = Auth::id();

        $this->registrations = Penyertaan::with(['event', 'peserta'])
            ->where('pendaftar_id', $userId)
            ->where('event_id', $eventId)
            ->orderBy('id')
            ->get();
---
select * from `events` where `events`.`id` in (1)
select * from `penyertaan` where `pendaftar_id` = 2 and `event_id` = '1' order by `id` asc
select * from `pesertas` where `pesertas`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9)