app/Http/Controllers/EventController.php

select * from `events` where `events`.`id` = '1' limit 1
update `events` set `click_count` = `click_count` + 1, `events`.`updated_at` = '2025-11-27 03:40:50' where `id` = 1
---
    public function trackClick($id)
    {
        $event = Event::findOrFail($id);

        $event->increment('click_count');